#+TITLE:XenHunt Config (customize)
#+AUTHOR: Evgeny Berlizov (XenHunt)
#+DESCRIPTION: XenHunt's config of customization
#+STARTUP: content
#+PROPERTY: header-args :tangle beauty.el
** Dashboard 
:PROPERTIES:
:CUSTOM_ID: dashboard
:END:
#+begin_src emacs-lisp
(use-package dashboard
  :init
  (setq dashboard-set-file-icons t)
  (setq dashboard-set-heading-icons t)
  (setq dashboard-display-icons-p t)
  (defvar dashboard-books-alist nil
    "List of books for dashboard")

  (defun get-recent-books (&optional list-size)
    "Returns a list of recent books (PDF, EPUB, DJVU) based on LIST-SIZE"
    (let ((list-size (or list-size 10))
          result
          )
      (dolist (element recentf-list)
        (when (and (file-name-extension element) (or (string= (downcase (file-name-extension element)) "pdf")
                                                     (string= (downcase (file-name-extension element)) "epub")
                                                     (string= (downcase (file-name-extension element)) "djvu")
                                                     ))
          (add-to-list 'result element)
          )
        )
      (nreverse (cl-subseq result 0 (min (length result) list-size)))
      )
    )
  (defun my/dashboard-insert-books (list-size)
    "Add the list of LIST-SIZE items of recent books"
    (dashboard-insert-section
     "Books"
     (dashboard-shorten-paths (get-recent-books list-size) 'dashboard-books-alist 'books)
     list-size
     'books
     (dashboard-get-shortcut 'books)
     `(lambda (&rest ignore)
        (find-file-existing (dashboard-expand-path-alist ,el dashboard-books-alist))
        (dashboard-refresh-buffer)
        )
     (format "%s" el)
     ))
  
  :custom
  (dashboard-modify-heading-icons '((recents . "file-text")
                                    (bookmarks . "book")))
  (dashboard-items '(
		     (recents . 5)
		     (bookmarks . 5)
		     (projects . 5)
		     (agenda . 5)
                     ;; (books . 5)
                     ))
  (dashboard-item-shortcuts '(
			      (recents   . "r")
                              (bookmarks . "m")
                              (projects  . "p")
			      (agenda . "a")
                              ;; (books . "b")
                              ))
  (dashboard-projects-backend 'projectile)
  (dashboard-startup-banner "~/.emacs.d/logo.png")
  :config

  (add-to-list 'dashboard-item-shortcuts '(books . "b"))
  (add-to-list 'dashboard-item-generators  '(books . my/dashboard-insert-books))
  ;; (add-to-list 'dashboard-items '(books . 5))
  
  (add-hook 'elpaca-after-init-hook #'dashboard-insert-startupify-lists)
  (add-hook 'elpaca-after-init-hook #'dashboard-initialize)
  
  (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
  (dashboard-setup-startup-hook)
  )
#+end_src

#+RESULTS:
: [nil 26328 32309 232892 nil elpaca-process-queues nil nil 53000 nil]

